#ifndef __GD_H__
#define __GD_H__

#include <cocos2d.h>
#include <cocos-ext.h>
#include <patterns.hpp>

inline auto base = reinterpret_cast<uintptr_t>(GetModuleHandle(0));
inline auto libcocos2d = reinterpret_cast<uintptr_t>(GetModuleHandleA("libcocos2d.dll"));

inline bool gdh_init() {
	static_assert(sizeof(std::string) == 24,
		"\n[GD.H] std::string is not 24 bytes\n" \
		"[GD.H] Any classes containing member strings or using strings in functions will break!\n" \
		"[GD.H] this is caused by building in Debug mode, to fix switch to Release\n");
	return base;
}

//hi
#define TodoReturn void
#define cast(type, call, value_types, values, addr) reinterpret_cast<type(call)value_types>(addr)values;
#define addrViaPattern(tar) \
auto addr = patterns::find_pattern(tar, ""); \
if (!addr) cocos2d::CCMessageBox("find_pattern failed", __FUNCTION__); \

//predcl
#if 1
class PlayerButtonCommand;
class FMODSound;
class AdvancedFollowInstance;
class SFXTriggerInstance;
class EventTriggerInstance;
class SongChannelState;
class ChanceObject;
class GameObjectPhysics;
class DynamicObjectAction;
class GJTransformState;
class CAState;
class GJPointDouble;
class GJDropDownLayer;
class GJAccountDelegate;
class FLAlertLayerProtocol;
class AccountHelpLayer;
class GJAccountBackupDelegate;
class GJAccountSyncDelegate;
class AccountLayer;
class FLAlertLayer;
class TextInputDelegate;
class GJAccountLoginDelegate;
class AccountLoginLayer;
class GJAccountRegisterDelegate;
class AccountRegisterLayer;

class SetupInteractObjectPopup;
class SetupItemCompareTriggerPopup;
class SetupItemEditTriggerPopup;
class SetupKeyframeAnimPopup;
class SetupKeyframePopup;
class SetupMGTrigger;
class SetupMoveCommandPopup;
class SetupObjectControlPopup;
class SetupObjectOptions2Popup;
class SetupObjectOptionsPopup;
class SetupObjectTogglePopup;
class SetupOpacityPopup;
class SetupOptionsTriggerPopup;
class SetupPersistentItemTriggerPopup;
class SetupPickupTriggerPopup;
class SetupPlatformerEndPopup;
class SetupPlayerControlPopup;
class SetupPortalPopup;
class SetupPulsePopup;
class SetupRandAdvTriggerPopup;
class SetupRandTriggerPopup;
class SetupResetTriggerPopup;
class SetupReverbPopup;
class SetupRotateCommandPopup;
class SetupRotateGameplayPopup;
class SetupRotatePopup;
class SetupSequenceTriggerPopup;
class SetupSFXEditPopup;
class SFXBrowserDelegate;
class SetupSFXPopup;
class SetupShaderEffectPopup;
class SetupShakePopup;
class SetupSmartBlockLayer;
class SetupSmartTemplateLayer;
class SongPlaybackDelegate;
class SetupSongTriggerPopup;
class SetupSpawnParticlePopup;
class SetupSpawnPopup;
class SetupStaticCameraPopup;
class SetupStopTriggerPopup;
class SetupTeleportPopup;
class SetupTimerControlTriggerPopup;
class SetupTimerEventTriggerPopup;
class SetupTimerTriggerPopup;
class SetupTimeWarpPopup;
class SetupTouchTogglePopup;
class SetupTransformPopup;
class SetupZoomTriggerPopup;
class SFXBrowser;
class SFXInfoObject;
class SFXFolderObject;
class SFXSearchResult;
class SFXTriggerGameObject;
class ShaderGameObject;
class ShaderLayer;
class ShardsPage;
class ShareCommentLayer;
class ShareLevelLayer;
class ShareLevelSettingsLayer;
class ShareListLayer;
class SimpleObject;
class SimplePlayer;
class SlideInLayer;
class Slider;
class SliderThumb;
class SliderTouchLogic;
class SmartGameObject;
class SmartTemplateCell;
class SongCell;
class SongInfoLayer;
class SongInfoObject;
class SongObject;
class SongOptionsLayer;
class SongSelectNode;
class SongsLayer;
class SongTriggerGameObject;
class SpawnParticleGameObject;
class SpawnTriggerAction;
class SpawnTriggerGameObject;
class SpecialAnimGameObject;
class SpriteAnimationManager;
class SpriteDescription;
class StartPosObject;
class StatsCell;
class StatsLayer;
class StatsObject;
class SupportLayer;
class TableView;
class TeleportPortalObject;
class TextAlertPopup;
class TextArea;
class TextGameObject;
class TextStyleSection;
class TimerTriggerGameObject;
class TopArtistsLayer;
class TOSPopup;
class TransformTriggerGameObject;
class TriggerControlGameObject;
class TutorialLayer;
class TutorialPopup;
class UILayer;
class UIObjectSettingsPopup;
class UIOptionsLayer;
class UISaveLoadLayer;
class UISettingsGameObject;
class UndoObject;
class UpdateAccountSettingsPopup;
class UploadActionPopup;
class UploadListPopup;
class UploadPopup;
class URLCell;
class URLViewLayer;
class VideoOptionsLayer;
class WorldLevelPage;
class WorldSelectLayer;
#endif // 1

// https://github.com/geode-sdk/geode/blob/main/loader/include/Geode/utils/SeedValue.hpp
#if 1
struct BaseSeedValue
{
	BaseSeedValue() = default;
	BaseSeedValue(BaseSeedValue const& other) = default;
	BaseSeedValue(BaseSeedValue&& other) = default;
	BaseSeedValue& operator=(BaseSeedValue const& other) = default;
	BaseSeedValue& operator=(BaseSeedValue&& other) = default;
};
struct SeedValueRSV : public BaseSeedValue
{
	int m_value_rand;
	int m_value_seed;
	int m_value;

	int value() const { return m_value; }
};
struct SeedValueVSR : public BaseSeedValue
{
	int m_value;
	int m_value_seed;
	int m_value_rand;

	int value() const { return m_value; }
};
struct SeedValueRS : public BaseSeedValue
{
	int m_value_rand;
	int m_value_seed;

	int value() const { return m_value_rand - m_value_seed; }
};
#endif // 1

//levels stuff
#if 1
enum GJLevelType {
	kGJLevelTypeLocal = 1,
	kGJLevelTypeEditor = 2,
	kGJLevelTypeSaved = 3
};
enum GJDifficulty {
	kGJDifficultyAuto = 0,
	kGJDifficultyEasy = 1,
	kGJDifficultyNormal = 2,
	kGJDifficultyHard = 3,
	kGJDifficultyHarder = 4,
	kGJDifficultyInsane = 5,
	kGJDifficultyDemon = 6,
	kGJDifficultyDemonEasy = 7,
	kGJDifficultyDemonMedium = 8,
	kGJDifficultyDemonInsane = 9,
	kGJDifficultyDemonExtreme = 10
};
class GJGameLevel /* 0x3bc */ : public cocos2d::CCNode {
public:

	cocos2d::CCDictionary* m_pLastBuildSave;   // 0xec
	SeedValueRSV m_nLevelID;      // 0xf8
	std::string m_sLevelName;       // 0xfc
	std::string m_sLevelDesc;       // 0x114
	std::string m_sLevelString;     // 0x12c
	std::string m_sCreatorName;     // 0x144
	std::string m_sRecordString;    // 0x15c
	std::string m_sUploadDate; // 0x174
	std::string m_sUpdateDate; // 0x18c

	std::string m_unkString1;
	std::string m_unkString2;

	cocos2d::CCPoint m_unkPoint;
	SeedValueRSV m_userID;
	SeedValueRSV m_accountID;
	GJDifficulty m_difficulty;
	int m_audioTrack;
	int m_songID;
	int m_levelRev;
	bool m_unlisted;
	bool m_friendsOnly;
	SeedValueRSV m_objectCount;
	int m_levelIndex;
	int m_ratings;
	int m_ratingsSum;
	int m_downloads;
	bool m_isEditable;
	bool m_gauntletLevel;
	bool m_gauntletLevel2;
	int m_workingTime;
	int m_workingTime2;
	bool m_lowDetailMode;
	bool m_lowDetailModeToggled;
	bool m_selected;
	bool m_localOrSaved;
	bool m_disableShake;
	SeedValueRS m_isVerified;
	bool m_isVerifiedRaw;
	bool m_isUploaded;
	bool m_hasBeenModified;
	int m_levelVersion;
	int m_gameVersion;

	SeedValueRSV m_attempts;
	SeedValueRSV m_jumps;
	SeedValueRSV m_clicks;
	SeedValueRSV m_attemptTime;
	int m_chk;
	bool m_isChkValid;
	bool m_isCompletionLegitimate;
	SeedValueVSR m_normalPercent;
	SeedValueRSV m_orbCompletion;
